package ru.site.start.lesson25;

public class HomeWork {
}


//    ѕереименуйте класс Lesson24 из последнего домашнего задани€ в
//    Lesson25 и измените его метод main следующим образом. —оздайте в
//        нЄм 2 массива типа Speakable и типа Animal, которые будут содержать все
//        возможные ссылочные переменные, ссылающиес€ на все возможные
//        объекты. »спользу€ if и instanceof провер€йте на какой объект ссылаетс€
//        переменна€ и выводите на экран соответствующие переменные данного
//        объекта и вызывайте его методы.

