package ru.site.lesson10;

import static ru.site.lesson9.Math1.*; // Импортируются все статические методы и статические переменные с класса, который расположен в другом пэкэдже


/*
 * Комментарий - строка 1
 * Комментарий - строка 2
 * Комментарий - строка 3
 * Комментарий - строка 4
 * Комментарий - строка 5
 */


/*
 Комментарий - строка 1
 Комментарий - строка 2
 Комментарий - строка 3
 Комментарий - строка 4
 Комментарий - строка 5
 */


/**
 * Комментарий - строка 1
 * Комментарий - строка 2
 * Комментарий - строка 3
 * Комментарий - строка 4
 */


/**
 Комментарий - строка 1
 Комментарий - строка 2
 Комментарий - строка 3
 Комментарий - строка 4
 */


public class Start {
	
	static int a = 10;
	
	static void sum() {
		System.out.println("Текст из текущего класса");
	}
	
	public static void main(String[] args) {
		
		System.out.println(a);
		System.out.println(ru.site.lesson9.Math1.a);
		System.out.println(b);
		sum();
		ru.site.lesson9.Math1.sum();
		
	}

}
