package ru.site.abstractclass;

public abstract class Fish implements abstractMethod {

//	swim - плавать
//	breathe - дышать
//	eat - есть
	
//  в абстракном классе должны быть все абстрактные методы
	
//	если в абстрактном классе есть абстрактные методы, то все эти методы должны быть в дополнительных классах, где используются эти абстрактные методы (в классах, где идет наследование extends). Если какой-то метод будет удален с класса, в который вызываются абстрактные методы, то будет ошибка. Где extends должны быть все абстрактные методы указаны, чтобы не было ошибки.
	
//  создан интерфейс. в него перенесены абстрактные классы.
	
}
