package ru.site.section3_2;

// Шаг 5

import java.util.ArrayList;
import java.util.List;
import java.util.Random;

// Действие 1
// Код ниже работает, но позволяет добавлять в команду любого участника. Если эта команда школьников, то в нее должны вступать только школьники, а, написав так, как ниже, добавиться могут и студенты, и работники в том числе. Поэтому код закомментировал, а ниже написан правильный вариант.
//public class Team {
//	
//	private String name;
//	private List<Participant> participants = new ArrayList<>();

// Действие 2
// Правильный v1 вариант кода. Чтобы в команду школьников добавлялись только школьники. Тоже самое и для студентов и для взрослых (работников).
//public class Team<T> {
	
// Действие 7
// Правильный код v2. Теперь при создании команды можно выбирать один из объектов, указывая в дженериках (школьники, студенты, работники). Нельзя с текущим методом в дженерики указать <String> или <StringBuilder> и создавать любой объект, как это было доступно в предыдущем способе.
public class Team<T extends Participant> {
	
	private String name;
	private List<T> participants = new ArrayList<>();

	public Team(String name) {
		this.name = name;
	}
	
	// Действие 3
	// Не правильный вариант. Так будут добавляться в команду школьников и школьники, и стуненты, и взрослые
//	public void addNewParticipant(Participant participant) {
	
	// Действие 4
	// Правильный вариант. Может добавлять только участника типа Т
	public void addNewParticipant(T participant) {
		participants.add(participant);
		
		// Действие 5
		// Рабочий вариант, но для ситуации, когда в команду школьников можно добавлять еще стунедтов и взрослых, поэтому закомментировал. Ниже измененный вариант
//		System.out.println("В команду " + name + " был добавлен новый участник " + participant.getName());
		
		// Действие 6
		// Правильный вариант v1. У переменной типа Т (Participant) нет метода getName, поэтому нужно сделать каст.
//		System.out.println("В команду " + name + " был добавлен новый участник " + ((Participant) participant).getName());

		// Действие 8
		// Правильный вариант v2. Из-за того старый вариант v1 был для public class Team<T> { , а новый вариант для public class Team<T extends Participant> { , то теперь каст можно не использовать, но можно и оставить (с этого примера убрал каст)
		System.out.println("В команду " + name + " был добавлен новый участник " + participant.getName());
	}
	
	// Действие 9
	// Данная строка позволяет добавлять к первой команде вторую, но все команды подходят для добавления. Если выбрать школьников, то команда школьников, студентов, взрослых - все команды подойдут, а одна комада должна играть против другой. Обе команды с одной логи должны быть.
	//	public void playWith(Team team) {
	
	// Чтобы можно было добавлять только команду с той же логи, что и первая команда, добавлен дженерик <T>.
	// Теперь обе команды одной логи будут играть против друг друга
	public void playWith(Team<T> team) {
		String winnerName;
		Random random = new Random();
		int i = random.nextInt(2); // Генерируется 2 варианта: 0 и 1
		if(i==0) {
			winnerName = this.name;
		} else {
			winnerName = team.name;
		}
		System.out.println("Выиграла команда " + winnerName);
	}
	
}
