// Урок от Book Yakov Fine

/*
 *  Здесь можно писать комментарии
 *  на много строк, 
 *  чтобы подробно что-то описать.
 *  Это технический комментарий для вывода в html
 */


/*
 Это обычный
 многостройчный
 комментарий
 */

// короткие комментарии на 1 строку

/**
 * Выше есть похожий комментарий. Скорее синий - технический, а зеленый - обычный длинный
 * Текст 1
 * Текст 2
 */

package ru.site.comments;

public class Start {

	public static void main(String[] args) {
		
		int a = 1;
		System.out.println(a);
	}

}
