// Урок от себя

package ru.site.arraythreeandfourdimensional;

public class Start2 {

	public static void main(String[] args) {

		// Четырехмерный массив
		
		int one = 1; // 1 строка
		int two = 2; // 2 столбика
		int three = 3; // 3 подстроки
		int four = 4; // 4 подстолбика
		
		// Трехмерный и четырехмерный массив по-разному считается и выводится. В трехмерном начинается со столбика, а в четырехмерном начинается со строки. Четные массивы начинаются со строки, а не четные со столбика.
		
		// Как считать значения для четырехмерного массива: строка, столбик, подстрока, подстолбик.
		
//		Правильный вариант вывода данных: порядковый номер главной строки, порядковый номер главного столбика. Это для двухмерного массива. Для трехмерного добавляется подстроки. А для четырехмерного - подстолбики. В таком порядке данные выводятся. Но нужно учитывать, что если это четырехмерный массив, то будет **** (четыре значения). Кол-во столбиков (основных) и кол-во строк (основных) будет влиять на то, в какой очередности будут выводиться данные. Сначала будут выводиться данные, которые 0000, потом 0010, потом 0100, потом 1000. Не может 1000 вывестись первой или второй по счету. Так что правильно назначать данные в ячейки по номерам массива, чтобы данные последовательно выводились, а не через 1-2 блока. Вывод данных в таком порядке: выбирается строка, далее столбик, и последовательно подстроки выводятся главной строки. После если на этой строке есть еще другие главные столбики, то их выводит. То есть сначала по столбику 0 все выведет, потом по столбику 1. А не сразу 0 и 1 всю строку.
		
		int[][][][] array = new int[one][two][three][four];
		
		array[0][0][0][0] = 1;
		array[0][0][0][1] = 2;
		array[0][0][0][2] = 3;
		array[0][0][0][3] = 4;
		array[0][0][1][0] = 5;
		array[0][0][1][1] = 6;
		array[0][0][1][2] = 7;
		array[0][0][1][3] = 8;
		array[0][0][2][0] = 9;
		array[0][0][2][1] = 10;
		array[0][0][2][2] = 11;
		array[0][0][2][3] = 12;

		array[0][1][0][0] = 100;
		array[0][1][0][1] = 101;
		array[0][1][0][2] = 102;
		array[0][1][0][3] = 103;
		array[0][1][1][0] = 104;
		array[0][1][1][1] = 105;
		array[0][1][1][2] = 106;
		array[0][1][1][3] = 107;
		array[0][1][2][0] = 108;
		array[0][1][2][1] = 109;
		array[0][1][2][2] = 110;
		array[0][1][2][3] = 111;
		
		for (int a = 0; a < one; a++) {
			for (int b = 0; b < two; b++) {
				for (int c = 0; c < three; c++) {
					for (int d = 0; d < four; d++) {

						System.out.print(array[a][b][c][d] + " ");
					}
					System.out.println();
				}
				System.out.println();
			}
		}

	}
}